Revit 2027 API
BuiltInFailures.ElectricalFailures.UnsupportedTransformerPrimaryDS Property
 [Distribution System Name] cannot appear on the primary side of the transformer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnsupportedTransformerPrimaryDS { get; }
Public Shared ReadOnly Property UnsupportedTransformerPrimaryDS As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnsupportedTransformerPrimaryDS {
	FailureDefinitionId^ get ();
}
static member UnsupportedTransformerPrimaryDS : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace